﻿<?php
require_once "vendor/autoload.php";
use Gsons\App;

//需要监听的房间
$config = [
    "HuYa" => [
        995713=>'CICI',
        249648=>"全素颜",
        139236=>'瑶池',
    ],
    // "Egame"=>[
    //     619364874=>'菇七七'
    // ],
    "CC" => [
        347831124 => "七秒",
        347946388 => "彤彤",
        346509863 => "小静静",
        347851457 => "小可Angel的",
        346950429 => "小棱子"
    ],
    "DouYu" => [
        7130628 => "由悠",
        1360423 => "seven悠悠",
        6837285=>"影熙",
        6192525=>"wenwen儿",
        6798238=>"小慕林",
        7260758=>"亦亦ella",
        5469810 => "乔妹",
        6653695 => "福茶",
        7126038 => "张慕言",
        968987 => "南妹儿",
        5818349 => '米儿',
        4632993 => '小深深儿'
    ],
    "YY" => [
        95825545 => "漫漫",
        41064110 => "心儿",
        1353213733 => "宠儿",
        1330802494 => "晓晓",
        22490906 => '小白白',
        26713667 => '嫣嫣'

    ],
    // "Inke" => [
    //     704386978 => "诺诺",
    //     714172814 => "韩静儿",
    //     10284346 => "MMMMM",
    //     722035883 => "语嫣",
    //     43873157 => '小师妹',
    //     715471317 => '临兮兮',
    //     919084011 => '祖儿',
    //     188214787 => '白菜'
    // ]
];

$record_path = "./video";
//初始化配置
App::init();
//开始监听录制
//App::run($config, true, false,$record_path);
 App::run($config, true, true,$record_path);
